In [1]:
import pandas as pd
import sqlalchemy
from sqlalchemy import create_engine
import pymysql

In [4]:
#1
from getpass import getpass

password = getpass("Introduce tu contraseña de MySQL: ")

connection_string = f"mysql+pymysql://root:{password}@localhost/sakila"
engine = create_engine(connection_string)

Introduce tu contraseña de MySQL:  ········

In [6]:
engine.connect()

In [12]:
#2
def rentals_month(engine, month, year):
    query = f'''
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = {month}
          AND YEAR(rental_date) = {year};
    '''
    
    with engine.connect() as connection:
        result = connection.execute(sqlalchemy.text(query))
        df = pd.DataFrame(result.fetchall(), columns=result.keys())
    
    return df

In [14]:
may_rentals = rentals_month(engine, 5, 2005)
may_rentals.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [28]:
#3
def rental_count_month(df, month, year):
    column_name = f"rentals_{month:02}_{year}"
    grouped = df.groupby('customer_id').size().reset_index(name=column_name)
    return grouped

In [18]:
may_rentals = rentals_month(engine, 5, 2005)
rental_count_month(may_rentals, 5, 2005).head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [24]:
#4
def compare_rentals(df1, df2):
    combined = pd.merge(df1, df2, on='customer_id', how='outer').fillna(0)
    col1 = df1.columns[1]
    col2 = df2.columns[1]
    combined['difference'] = combined[col2] - combined[col1]
    
    return combined

In [26]:
may = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
june = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)
compare_rentals(may, june).head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1              2.0              7.0         5.0
1            2              1.0              1.0         0.0
2            3              2.0              4.0         2.0
3            4              0.0              6.0         6.0
4            5              3.0              5.0         2.0